{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "input_dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv-1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input", 0, 0]]], "name": "conv-1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool-1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["conv-1", 0, 0]]], "name": "pool-1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv-2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["pool-1", 0, 0]]], "name": "conv-2"}, {"class_name": "MaxPooling2D", "config": {"name": "pool-2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["conv-2", 0, 0]]], "name": "pool-2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv-3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["pool-2", 0, 0]]], "name": "conv-3"}, {"class_name": "MaxPooling2D", "config": {"name": "pool-3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["conv-3", 0, 0]]], "name": "pool-3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["pool-3", 0, 0]]], "name": "flatten_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1920, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 300}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["dense", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_0", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "digit_0"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "digit_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "digit_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "digit_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 300, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "digit_4"}], "input_layers": [["input", 0, 0]], "output_layers": [["digit_0", 0, 0], ["digit_1", 0, 0], ["digit_2", 0, 0], ["digit_3", 0, 0], ["digit_4", 0, 0]], "name": "model_3"}}