{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "input_dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": [], "name": "input"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv-1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 4, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 10, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 4}, "inbound_nodes": [[["input", 0, 0]]], "name": "conv-1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool-1", "trainable": true, "dim_ordering": "tf", "pool_size": [4, 4], "strides": [4, 4], "border_mode": "valid"}, "inbound_nodes": [[["conv-1", 0, 0]]], "name": "pool-1"}, {"class_name": "Reshape", "config": {"target_shape": [-1], "trainable": true, "name": "reshape"}, "inbound_nodes": [[["pool-1", 0, 0]]], "name": "reshape"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 510, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 22}, "inbound_nodes": [[["reshape", 0, 0]]], "name": "dense"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_0", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 22, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense", 0, 0]]], "name": "digit_0"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 22, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense", 0, 0]]], "name": "digit_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 22, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense", 0, 0]]], "name": "digit_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 22, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense", 0, 0]]], "name": "digit_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "digit_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 22, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense", 0, 0]]], "name": "digit_4"}], "input_layers": [["input", 0, 0]], "output_layers": [["digit_0", 0, 0], ["digit_1", 0, 0], ["digit_2", 0, 0], ["digit_3", 0, 0], ["digit_4", 0, 0]], "name": "model_55"}}